2022_08_24/app/views/emails/create.js.erb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "A Confederacy of Dunces"], ["body", "I'm going to make him an offer he can't refuse."], ["created_at", "2022-08-25 08:19:09.639719"], ["updated_at", "2022-08-25 08:19:09.639719"]]
---
document.querySelectorAll("ul")[1].insertAdjacentHTML("beforeend", "<%= j render 'email_object', email: @email %>");