2022_08_04/app/controllers/comment_controller.rb

  def create
    @comments = Comment.all
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.new(user: current_user, content: params['comment_content'], gossip_id: params[:gossip_id])
    if @comment.save
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Bof "], ["user_id", 21], ["gossip_id", 1], ["created_at", "2022-08-04 19:56:46.063466"], ["updated_at", "2022-08-04 19:56:46.063466"]]

  def new
    puts params.inspect
    puts params[:id]
    @gossip = Gossip.find_by_id(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" IS NULL LIMIT $1  [["LIMIT", 1]]