2022_08_04/app/controllers/gossip_controller.rb

  def create
    @gossips = Gossip.all
    @gossip = Gossip.new(
      title: params[:gossip_title],
      content: params[:gossip_content]
    )
    @gossip.user = User.find_by(id: session[:user_id])
    if @gossip.save
---
SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "test2"], ["user_id", 22], ["created_at", "2022-08-05 07:13:56.266546"], ["updated_at", "2022-08-05 07:13:56.266546"]]

  def show
    @gossip = Gossip.find_by_id(params[:id])
    @comments = Comment.where(gossip_id: params[:id])
    @like_count = Like.where(gossip_id: @gossip.id).count
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]