2022_08_04/app/controllers/user_controller.rb

INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2022-08-05 07:10:31.480355"], ["updated_at", "2022-08-05 07:10:31.480355"]]
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Saint-Louis"], ["LIMIT", 1]]
---
  def create
    @user = User.new(
      first_name: params[:first_name],
      last_name: params[:last_name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation],
      city: City.find_or_create_by(name: params[:city])
    )
    if @user.save