2022_08_04/w06d04/app/controllers/like_controller.rb

  def create
    gossip_id = params[:gossip_id].keys[0].to_i
    puts gossip_id
    puts current_user.id
    @like = Like.create(user_id: current_user.id, gossip_id: gossip_id)
---
INSERT INTO "likes" ("user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 21], ["gossip_id", 1], ["created_at", "2022-08-04 19:21:41.504087"], ["updated_at", "2022-08-04 19:21:41.504087"]]

  def destroy
    gossip_id = params[:gossip_id].keys[0].to_i
    like_id = Like.where(user_id: current_user.id, gossip_id: gossip_id).first.id
    Like.destroy(like_id)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."gossip_id" = $2 ORDER BY "likes"."id" ASC LIMIT $3  [["user_id", 22], ["gossip_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 503]]