2022_08_04/w06d04/app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sam.test@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:session_email])