2022_08_04/w06d04/app/views/gossip/index.html.erb

            <br>
            <%= gossip.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

            <span class="font-bold text-secondary">Comments:      </span>
            <%= gossip.comments.count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]