2022_08_04/app/views/gossip/create.html.erb

          <div class= "card-body">
            <span class="card-tile ">Author:      </span><%= gossip.user.first_name %><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]