2022_08_04/app/views/gossip/show.html.erb

    <div class= "card-body">
      <a class="font-bold" href="/user/<%= @gossip.user.id %>">Author: <%= @gossip.user.first_name %></a><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

            <% @comments.each do |comment| %>
              <span class="card-tile ">Author:      </span><%= comment.user.first_name %><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]