2022_08_04/w06d04/app/views/city/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
          <div class= "card-body">
            <span class="card-tile ">Author:      </span><%= gossip.user.first_name %><br>