2022_08_24/app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-08-24 09:19:11.027649"], ["updated_at", "2022-08-24 09:19:11.027649"], ["title", "test9"], ["deadline", "2022-08-31 00:00:00"], ["category_id", 1]]
---
<%# alert("le fichier JS est exécuté!"); %>
document.querySelectorAll(".card > ul")[<%= @task.category.id - 1%>].insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");