2022_08_01/app/views/static/index.html.erb

            <div class= "card-body">
              <span class="card-tile ">Author:      </span><%= gossip.user.first_name %><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]